a_ku_ya=int(input('如果要查询我们所信仰的水之女神请输6：'))
if a_ku_ya==6:
    print('阿库娅（a_ku_ya),阿克西斯教团所信仰的女神，她有一头浅蓝色的秀发，和深蓝色的深邃眼眸，她不仅是水之女神，还被人们私底下尊称为智慧女神，可以复活刚死不久的人，还掌握着一切治愈魔法和支援魔法，不能容忍不死族和恶魔。')
    print('''
    
    
    ''')
jiao_yi=int(input('如果要查询阿克西斯教的教义，请输666：'))
if jiao_yi==666:
    print('''
    
    以下为阿克西斯教团的教义：
     
    一，阿克西斯教徒努力就能做到，你们都是能干的人，就算失败了也不是你的错，
    不能成功都是世界的错。从不开心的事情中逃避即可，
    逃避不是失败，有句话就叫“逃避就是胜利”。
    
    二，犹豫过久得出的答案，无论如何选择都会后悔，反正都要后悔，就选择当下的快乐吧。
    别太担忧晚年如何，未来的你是否笑着，连神明也不知道，那就乐在当下吧。
    
    三，厄里斯的胸部是垫出来的。
    
    四，不想努力是世间的错，本性恶劣是环境的错，长得丑是遗传基因的错。
    不要责备自己，将责任推卸给他人便好，请放心，神会赦（she)免一切。
    
    五，汝，要爱巨乳，汝，要爱平贫乳；阿库西斯教的教义是容许一切。
    即使是同性恋者，即使是喜好非人长耳少女者，即使是萝莉控，即使是尼特，
    只要对象并非不死族或恶魔少女，只要有爱且不犯法，全都可以得到赦免。
    
    六，汝，勿要忍耐。想喝的时候就喝，想吃的时候就吃便好。因为明天并不见得还能吃得到。
    
    七，反正都要失败不如放手去做，失败之后跑路就好了。
    
    
    
    ''')

ru_jiao_jia_chi=int(input('见识完阿克西斯教的教义后，是否情不自禁涌起加入的想法？如果想要查询入教后福利，请输入999：'))
if ru_jiao_jia_chi==999:
    print('''
    
    阿克西斯教团入教加持如下：
    
    1，可以变得多才多艺;
    
    2,可以吓跑不死族和怪物；
    
    3，可以吓跑强盗和魔王军；
    
    4，即使在机动要塞毁灭者经过的地方，
    也能和杂草一起顽强的生存下来；
    
    5，可以在阿尔坎雷提亚领取可食用香皂和洗发精。
    
    
    
    ''')

jiao_tuan_jie_lv=input('''
        如果了解了我们伟大的女神阿库娅和阿克西斯教团的教义和加持后，想加入阿克西斯教，
        那么，只要遵循以下戒律，就算阿克西斯教徒了。
        
        想要查询阿克西斯教团戒律的请输入jjj:''')

if jiao_tuan_jie_lv=='jjj':#input返回的是字符串，所以==的右边也得是字符串，要加上英文的引号。
    print('''
    
    以下为阿克西斯教团的戒律：
    
    1,崇拜,赞美并爱戴我们的水之女神---阿库娅；
    
    2，帮助需要帮助的阿克西斯教徒；
    
    3，如果有普通人需要帮助，伸出援手的同时，
    给予其入教申请书；
    
    4，做不到以上三点的，阿库娅女神会降下神罚：
    在上厕所时，外面有人等，马桶却冲不出水。
    
    ''')
print('''











''')
input('请输入任意字符结束程序：')