ming_ci_ca_xun_zi_dian={}
ming_ci_ca_xun_zi_dian['胡成健']='一个出生于2007年1月24日的男孩，父亲是胡学清，母亲是邹冬兰。是独生子。小学就读于横市中心小学，初中就读于横市中学，高中就读于南康四中，大学就读于江西应用工程职业学院，学过美术，音乐，大学专业是软件技术。2025年1月24日成年，18岁。'
ming_ci_ca_xun_zi_dian['胡成龙']='一个男孩，出生于2000年，也许，父亲是胡学华---胡成健的二伯伯，胡成龙是胡成健的二哥（堂哥）。不戴眼镜，兴趣爱好广泛，会钓鱼，打乒乓球，打羽毛球。谈过三次女朋友，但是都没有成功，现在也没有结婚。'
ming_ci_ca_xun_zi_dian['胡成凤']='一个女孩，出生于2007年，是胡成健的二姐（堂姐）。2025年时正在学会计。父亲是胡学华，是胡成龙的亲妹妹，和胡成健同岁，但比胡成健大一点。曾经在四中读学前教育系，当过幼师，后来因种种原因放弃了，现在读会计，考会计证。'
ming_ci_ca_xun_zi_dian['胡成林']='一个男孩，出生于19几几年，是胡成健的大哥（堂哥），2025年时已经有两个孩子了。是独生子。父亲是胡成健的大伯伯，母亲是胡成健的大伯母。在从事医院相关的工作。'
ming_ci_ca_xun_zi_dian['胡成玉']='一个女孩，胡成健的大姐（小表姐），出生于19几几年，父亲是刘姓姑爷，母亲是胡成健的小姑姑，已经成婚，有了一个女儿，名叫瑶瑶。在当小学老师，姐夫在二中当高中老师。我（胡成健）是瑶瑶的舅舅。'
ming_ci_ca_xun_zi_dian['严东平']='一个男孩，出生于19几几年，是胡成健的老表（大表哥），和严小英是同一个父母，2025年时正在开一家名为浩博智能家具的有限公司。胡成龙也在那家公司工作。已经结婚了，表嫂叫赖春梅，有一儿一女，一个叫严懿琳（女），一个叫严浩宇（男），两个孩子2025年都在南康实验小学读书，严懿琳读五年级，严浩宇读三年级。在南康住。'
ming_ci_ca_xun_zi_dian['刘星']='一个男孩，出生于19几几年，是胡成健的老表（小表哥），和胡成玉是同一个父母，母亲姓胡，已经谈到了女朋友，但是没有结婚。父亲姓刘，刘金盛，是胡成健的姑爷。是经济学博士，在大学里教书，做研究。30多岁了，戴着眼镜，微胖，气质不怒自威，在南康有一个学法律的朋友，吸烟。'
ming_ci_ca_xun_zi_dian['胡家畔（盘）']='男性，活了七十三年，是胡成健的爷爷，同样是胡成龙，胡成风，胡成林的爷爷，还是胡成玉，刘星，严东平，严小英的外公或佬爷。是胡学清，胡学华，胡学助，胡学。。。等五人的父亲。是从1949年活到20几几年的老人。生了五个儿女。最大的是胡成健的大姑姑，其次是胡成健的大伯伯，再其次是胡成健的小姑姑，在其次就是小伯伯，最小的就是胡成健的父亲。'
ming_ci_ca_xun_zi_dian['严小英']='一个女孩，出生于19几几年，是胡成健的表姐（大表姐），与严冬平是同样的父母，已经结婚了，姐夫名叫邓东平，有一儿一女，在横市读中学。'
ming_ci_ca_xun_zi_dian['胡学清']='胡家畔的最小的儿子（三儿子），胡成健的父亲，出生于1978年，驼背严重，身高一米五，有散光，没什么文化，以开麻将馆维生，有一个儿子。'
ming_ci_ca_xun_zi_dian['胡学助']='胡家畔最大的女儿，胡成健的大姑姑，身材矮小，不戴眼镜。有一儿一女，严东平（儿），严小英（女），丧夫？是严浩宇和严懿琳的奶奶，是邓天宇和邓艳的外婆。'
ming_ci_ca_xun_zi_dian['胡学?','男']='胡家畔的大儿子，胡成林的父亲，胡成健的大伯伯，胡成凤的大伯伯，胡成龙的大伯伯，胡成玉的舅舅，刘星的舅舅，严东平的舅舅，严小英的舅舅。是胡学华和胡学清的哥哥，是胡学助的弟第。曾经的工人。'
ming_ci_ca_xun_zi_dian['胡学华']='胡家畔的二儿子，是胡学清的二哥，有一儿一女，胡成龙和胡成风。'
ming_ci_ca_xun_zi_dian['胡学？',"女"]='胡家畔的二女儿，胡成玉和刘星的母亲，胡成健的小姑姑，身材矮小，不戴眼镜，留短发，在南康东域名都小区定居。开麻将馆。'
ming_ci_ca_xun_zi_dian['邹冬兰']='胡成健的母亲，出生于1988年。'


x=input("请输入你想要知到的人名：")
if x in ming_ci_ca_xun_zi_dian:
    print('您查询的人名为'+x+'，以下是ta的祥细信息。')
    print(ming_ci_ca_xun_zi_dian[x])
else:
    print('您查询的人名暂未收录。')
    print('本查询器收录了'+str(len(ming_ci_ca_xun_zi_dian))+'条名字。')
