print('''如果有一份真挚的爱情摆在你的面前，你的选择是？
'前情提要：你是一个高中生，学习成绩中等偏下，但是长相帅气，很受女生的欢迎。有三个女生非你不可，她们的名字分别是李静、邓欣、小美。
'a,小美：不戴眼镜，有刘海，黑色长发头发，黑色瞳孔，身高1.62，体重50kg,性格幽默风趣，非常可爱。
'b,邓欣：戴黑框眼镜，有一点刘海，黑色短发齐耳，棕色瞳孔，身高1.70，体重47.0kg,喜欢穿红色的外套，性格霸气，笑起来相当好看，当班干部，运动能力非常好，相当有魅力。
'c,李静：刘海齐眉，有时会戴黑框眼镜，但平是不戴，黑色秀发，性格文静，好奇心重，棕黑色瞳孔，大眼睛，喜欢看书，班上的普通学员，身高和你一样，体重43kg。
'd,都不选，女人算什么？有学习香吗？


''')
xuan_ze=input('起输入你的选择：')
if xuan_ze=='a':
    print('''\"小美，我喜欢你，请你和我在一起吧！\"
    ''')
elif xuan_ze=='b':
    print('')
elif xuan_ze=='c':
    print('')
elif xuan_ze=='d':
    print()
else:
    print('出错了，请输入可选的数据，还有可能是数字的大小写出错了，请结束程序后重新输入。')